{"id":"f14c22b8-ce28-432e-a03d-017317908132","projectId":"af58b4fd-f474-406e-b198-61e296496ff2","sessionName":"Test","description":null,"documentCount":2,"status":"text_extracted","extractedData":"{\"success\":true,\"extracted_texts\":[{\"file_name\":\"Asana_2025-07-25 (2).xlsx\",\"text_content\":\"Excel file content from Asana_2025-07-25 (2).xlsx:\\n\\n=== SHEET: MSA ===\\n                  Property                              Value\\n             MSA ID/Number                                   \\n            Effective Date                                   \\n             Governing Law State of California, United States\\nOverall DORA Applicability                              false\\n          Last Review Date                         2021-11-01\\n\\n=== SHEET: Parties ===\\n       Name             Role                                               Address\\nAsana, Inc. Service Provider 633 Folsom Street, Suite 100, San Francisco, CA 94107\\nBRYTER GmbH         Customer                Linienstraße 71, 10119 Berlin, Germany\\n\\n=== SHEET: DORA Relevant Clauses ===\\n                              Clause Title/Topic Section Reference                                                                                                                                                                                                                                                                                                                       Summary of Clause DORA Compliance Status                                                                                                                                                                                                                                                  Remediation Action Required\\n           Security; Protection of Customer Data               2.5 Asana commits to implementing and maintaining reasonable administrative, organizational, and technical safeguards for Customer Data protection, confidentiality, and integrity, at least as rigorous as measures described in their Data Security Standards. The Data Processing Addendum (DPA) also applies to Customer Personal Data.              Compliant                                                                                                                                                                                                                                                                    No action\\n Service Warranties (Availability/Functionality)             3.2.1                                                                                              Asana warrants that the Service will materially conform to the applicable Documentation and that Asana will not materially decrease the functionality of the Service. Remedies for breach include correction or termination with a refund.              Compliant                                                                                                                                                                                                                                                                    No action\\n                                  Malicious Code             3.2.3                                                                                                                                                  Asana warrants that the Service is free from, and Asana will not introduce, software viruses, worms, logic bombs, Trojan horses, or other code, files, or scripts intended to do harm.              Compliant                                                                                                                                                                                                                                                                    No action\\n                     Termination (Exit Strategy)     5.2, 5.3, 5.4                  Either party can terminate for material breach or insolvency. Upon termination, subscriptions and rights end, and Asana will refund prepaid unused fees. Customer Data is available for export for 30 days post-termination, after which Asana may delete it. Customer can request secure destruction within 180 days.   Requires Remediation                                                                                         Amend clause to include explicit termination assistance, data migration support, and a detailed exit strategy plan for critical services, specifying responsibilities and timelines.\\nConfidentiality (Sensitive Personal Information)               6.5                                                                                                   Customer agrees not to use the Service to send or store personal information deemed 'sensitive' or 'special' under applicable law, including but not limited to financial account information, health information, or biometric data.   Requires Remediation                                                                                              Clarify Asana's responsibilities and safeguards if Sensitive Personal Information is inadvertently stored, and ensure incident reporting mechanisms cover such data adequately.\\n            Indemnification (Third-Party Claims)          8.1, 8.3                                                                                                                                                      Asana indemnifies Customer for IP infringement claims related to the Service. Customer indemnifies Asana for IP infringement or privacy right violations related to Customer Data.         Not Applicable                                                                                                                                                                                                                                                                    No action\\n                           Liability Limitations     9.1, 9.2, 9.3                                             A party's aggregate liability is limited to the total amount paid by Customer in the preceding 12 months, excluding special, incidental, exemplary, or indirect damages. However, breaches of confidentiality and indemnification obligations are subject to a higher cap or no limitation.   Requires Remediation                                                                  Review liability caps and exclusions against DORA's requirements for critical ICT third-party providers, potentially requiring specific carve-outs for operational resilience failures or gross negligence.\\nExport Control and Economic Sanctions Compliance                10                              Both parties warrant they are not named on any U.S. government list of prohibited or restricted parties. Customer agrees not to access or use the Service in any manner that would cause any party to violate U.S. or international embargoes, economic sanctions, or export controls laws or regulations.         Not Applicable                                                                                                                                                                                                                                                                    No action\\nAccess to Non-Production Versions of the Service              11.6                                                                       Customer's use of beta, trial, or sandbox versions of the Service is at their own risk, provided 'as is' without warranties, not supported, and not subject to availability or security obligations. Asana has no liability for harm arising from these versions.         Not Applicable                                                                                                                                                                                                                                                                    No action\\n                                  Subcontracting          1.6, 2.5                                                                                                                                         Professional Services may be provided by Asana or its subcontractor. The Data Processing Addendum (DPA) applies to Customer Personal Data, which would cover data processing by subcontractors.   Requires Remediation                                             Add a dedicated clause on subcontracting, detailing Asana's obligations regarding its subcontractors, including audit rights, flow-down of DORA-relevant obligations, and notification requirements for critical subcontractors.\\n                                    Audit Rights                                                                                                                                                                                      The document does not contain an explicit clause granting the Customer audit rights over Asana's security, operational resilience, or compliance with the agreement.   Requires Remediation                                          Add a new clause granting the Customer explicit audit rights, including the right to conduct or commission audits of Asana's security, operational resilience, and compliance with the agreement, with reasonable notice and scope.\\n              Incident Management / Notification    2.6, 2.5 (DPA)                                                                                                                    Customer must notify Asana of unauthorized use or access to its account. Asana's Data Processing Addendum (DPA), referenced in the agreement, typically covers data breach notifications for Customer Personal Data.   Requires Remediation Add a dedicated clause outlining Asana's incident management process, including clear notification timelines, communication channels, and reporting requirements for all types of operational and security incidents affecting the Service, not just personal data breaches.\\nBusiness Continuity and Disaster Recovery (BCDR)                                                                                                                                      The document does not contain an explicit clause outlining Asana's Business Continuity and Disaster Recovery plans, including commitments to regular testing, or recovery time objectives/recovery point objectives.   Requires Remediation                                                                 Add a new clause detailing Asana's Business Continuity and Disaster Recovery plans, including commitments to regular testing, RTO/RPO objectives, and customer notification in case of BCDR plan activation.\\n          Performance Standards / Service Levels               2.1                                                               Asana will make the Service available to Customer and its End Users during the Subscription Term pursuant to the Agreement, including but not limited to the performance standards set forth in the Service Level Addendum available at https://asana.com/service-levels.              Compliant                                                                                                                                                                                                                                                                    No action\\n               Information Sharing / Cooperation    N/A (Implicit)                                                                                                       The document lacks a broad clause on mutual cooperation or information sharing specifically for operational resilience purposes, such as threat intelligence or vulnerability sharing, beyond specific notification requirements.   Requires Remediation                                                                           Add a clause encouraging or mandating information sharing and cooperation on cyber threats, vulnerabilities, and operational resilience best practices, where appropriate and legally permissible.\\n\\n=== SHEET: Services Covered ===\\n                                            Service Name/Description             Service Category   DORA Criticality\\nAsana's collaboration work management software as a service platform Software as a Service (SaaS) Critical/Important\\n                                           customer success services        Professional Services     Not Applicable\\n\\n\",\"word_count\":955},{\"file_name\":\"Asana Master Subscription Agreement (executable).pdf\",\"text_content\":\"asana\\nASANA MASTER SUBSCRIPTION AGREEMENT\\nThis Master Subscription Agreement and all applicable exhibits, attachments, addenda, and Order Forms are the complete\\nagreement between the parties identified in the signature block below regarding Customer's order from Asana of the\\nenterprise version of the Service (or other version mutually agreed by the parties) or Professional Services (the\\n\\\"Agreement\\\"). This Master Subscription Agreement is effective as of the last date of signature below (the \\\"Effective Date\\\").\\nIn the event of a conflict, an exhibit, attachment, addendum, or Order Form prevails over this Master Subscription\\nAgreement. End Users that are invited to use the Service by Customer are subject to the Asana User Terms of Service\\navailable at https://asana.com/terms#terms-of-service.\\n1.\\nDefinitions.\\n1.1. \\\"Affiliate\\\" means any entity that Controls, is Controlled by, or is under common Control with the Asana or the\\nCustomer entity agreeing to these terms, where \\\"Control\\\" means ownership of more than 50% of the voting interests\\nof the subject entity.\\n1.2. \\\"Customer Data\\\" means all information that Customer or its End Users submit to the Service.\\n1.3. \\\"Documentation\\\" means Asana's user guides, as updated from time to time, accessible via the \\\"Help\\\" feature of the\\nService.\\n1.4. \\\"End User\\\" means any individual who is authorized by Customer to use the Service under Customer's account,\\nincluding Customer's or its Affiliates' employees, consultants, contractors, or agents.\\n1.5. \\\"Order Form\\\" means an ordering document or an online order entered into between Customer and Asana (or\\nAffiliates of either party) specifying the Service or Professional Services to be provided under this Agreement.\\n1.6. \\\"Professional Services\\\" means the customer success services provided by Asana or its subcontractor.\\n1.7. \\\"Service\\\" means Asana's collaboration work management software as a service platform.\\n1.8. \\\"Subscription\\\" means the access to the Service acquired by Customer on a per End User basis.\\n1.9. \\\"Subscription Term\\\" means the term identified in the applicable Order Form or other ordering document, including\\n2.\\nany renewal term, during which Customer's End Users are permitted to use the Service.\\nThe Service.\\n2.1. Provision of the Service and Availability. Asana will make the Service acquired under an Order Form or other\\nordering document available to Customer and its End Users during the applicable Subscription Term pursuant to this\\nAgreement, including but not limited to the performance standards set forth in the Service Level Addendum available\\nat https://asana.com/service-levels. Subject to Section 3.2.1(b) (Service Warranties), Asana may update the content,\\nfunctionality, and user interface of the Service from time to time in its sole reasonable discretion. Some features and\\nfunctionality may be available only with certain versions of the Service. Customer agrees that its acquisition of the\\nService under this Agreement is not contingent on the delivery of future features or functionality.\\n2.2. Access Rights. Asana grants to Customer a non-exclusive, non-sublicensable, non-transferable (except as specifically\\npermitted in this Agreement) right to access and use the Service during the applicable Subscription Term pursuant to\\nthis Agreement, solely for Customer's internal business purposes, and subject to the applicable Order Form or other\\nordering document.\\n2.3. Affiliates. In addition to any access rights a Customer Affiliate may have as an End User of Customer, a Customer\\nAffiliate may separately acquire Subscriptions or Professional Services under this Agreement by entering into an Order\\nForm that incorporates by reference the terms of this Agreement, and in each such case, all references in this\\nAgreement to the Customer will be deemed to refer to the applicable Affiliate for purposes of that Order Form.\\nVersion 11-2021\\nConfidential\\n1\\nVersion 11-2021 Confidential 2\\n2.4. Acceptable Use Terms. The Service may not be used for unlawful, harmful, obscene, offensive, or fraudulent \\nCustomer Data or activity. Examples of prohibited activities are advocating or causing harm, interfering with or \\nviolating the integrity or security of a network or system, evading filters, sending unsolicited, abusive, or deceptive \\nmessages, introducing viruses or harmful code, or violating third party rights. Customer will not (a) make the Service \\navailable to anyone other than Customer and its End Users or use the Service for the benefit of anyone other than \\nCustomer or its Affiliates; (b) rent, sublicense, re-sell, assign, distribute, time share or similarly exploit the Service \\n(including allowing its employees or employees of its Affiliates to access the Service as guests instead of acquiring \\nEnd User Subscriptions for such employees); (c) reverse engineer, copy, modify, adapt, or hack the Service; (d) access \\nthe Service, the Documentation, or Asana’s Confidential Information to build a competitive product or service; or (e) \\nallow End User Subscriptions to be shared or used by more than one individual End User (except that End User \\nSubscriptions may be reassigned to new End Users replacing individuals who no longer use the Service for any \\npurpose). Asana may request that Customer suspend the account of any End User who: (a) violates this Agreement or \\nAsana’s User Terms of Service; or (b) is using the Service in a manner that Asana reasonably believes may cause a \\nsecurity risk, a disruption to others’ use of the Service, or liability for Asana. If Customer fails to promptly suspend \\nor terminate such End User’s account, Asana reserves the right to do so.\\n2.5. Security; Protection of Customer Data. Asana will implement and maintain reasonable administrative, \\norganizational, and technical safeguards designed for the protection, confidentiality, and integrity of Customer Data \\nat least as rigorous as the measures described in the Data Security Standards available at https://asana.com/security standards. Asana reserves the right to modify the Data Security Standards from time to time provided such \\nmodification will not materially and adversely diminish the overall security of the Service during the applicable \\nSubscription Term. In addition, the Asana Data Processing Addendum, available at https://asana.com/terms#data processing (“DPA”), will apply to any Customer Personal Data (as such term is defined in the DPA) included in \\nCustomer Data.\\n2.6. Administration of Customer’s Account. Customer acknowledges that it retains administrative control over to whom \\nit grants access to Customer Data hosted in the Service. Customer may specify one or more End Users as administrators \\n(each an “Administrator”) to manage its account, and Asana is entitled to rely on communications from such \\nAdministrators and other Customer employees when servicing Customer’s account. Customer is responsible for use \\nof the Service by its End Users and for their compliance with this Agreement. Customer is solely responsible for the \\naccuracy, quality, and legality of Customer Data. Customer will promptly notify Asana if it becomes aware of any \\nunauthorized use or access to Customer’s account or the Service.\\n2.7. Customer’s Use of Third Party Services. Customer may install or enable third party services for use with the Service, \\nsuch as online applications, offline software products, or services that utilize the Asana API or otherwise connect with \\nthe Service (“Third Party Services”). Any acquisition and use by Customer or its End Users of such Third Party \\nServices is solely the responsibility of Customer and the applicable third party provider. Customer acknowledges that \\nproviders of such Third Party Services may have access to Customer Data in connection with the interoperation and \\nsupport of such Third Party Services with the Service. To the extent Customer authorizes the access or transmission \\nof Customer Data through a Third Party Service, such Third Party Service terms will govern, and Asana will not be \\nresponsible for, any use, disclosure, modification or deletion of such Customer Data or for any act or omission on the \\npart of such third party provider or its service.\\n3. Representations and Warranties.\\n3.1. Mutual Warranties. Each party represents and warrants that it will comply with all laws, rules, and regulations \\napplicable to the exercise of its rights and performance of its obligations under this Agreement.\\n3.2. By Asana.\\n3.2.1. Service Warranties. Asana warrants during the applicable Subscription Term that: (a) the Service will materially \\nconform to the applicable Documentation; and (b) Asana will not materially decrease the functionality of the Service. \\nFor any breach of the foregoing warranties, as Asana’s sole liability and Customer’s exclusive remedy, Asana will \\ncorrect the non-conforming Service, and, if Asana is unable to correct the Service within a commercially reasonable \\nVersion 11-2021 Confidential 3\\ntime following receipt of written notice of breach, then Customer will be entitled to terminate the applicable Order \\nForm and receive a refund of any prepaid, unused fees applicable to the remaining portion of the Subscription Term \\nmeasured from the effective date of termination.\\n3.2.2. Professional Services Warranty. Asana warrants that the Professional Services will be performed in a professional \\nand workmanlike manner using resources with the requisite skills, experience, and knowledge. For any breach of this \\nwarranty, as Asana’s sole liability and Customer’s exclusive remedy, Asana will, at its option (a) re-perform the \\napplicable Professional Services that fail to meet this warranty, or (b) refund to Customer the fees paid for the non conforming Professional Services.\\n3.2.3. Malicious Code. Asana warrants that the Service is free from, and Asana will not introduce, software viruses, worms, \\nlogic bombs, Trojan horses or other code, files, or scripts intended to do harm (“Malicious Code”).\\n3.3. By Customer. Customer represents and warrants that it is entitled to transfer the Customer Data to Asana so that \\nAsana and its authorized third party service providers may lawfully use, process, and transfer the Customer Data in \\naccordance with this Agreement on Customer’s behalf.\\n3.4. Disclaimer. Except as expressly provided for in this Agreement, Asana does not warrant uninterrupted or \\nerror-free operation of the Service or that Asana will correct all defects or prevent third party disruptions or \\nunauthorized third party access. These warranties are the exclusive warranties from Asana and replace all \\nother warranties, including the implied warranties or conditions of satisfactory quality, merchantability, non infringement, and fitness for a particular purpose. Asana warranties will not apply if there has been misuse, \\nmodification, damages not caused by Asana, or failure to comply with instructions provided by Asana. Each \\nparty disclaims all liability for any harm or damages caused by any third-party hosting providers. Asana makes \\nbeta, trial, proof of concept, and “sandbox” versions of the Service available as-is without warranties of any \\nkind.\\n4. Payment.\\n4.1. Payment. Customer will pay all undisputed amounts due under the applicable Order Form within thirty (30) days of \\ninvoice date. If Customer disputes any part of an invoice in good faith, Customer will pay the undisputed part and \\nprovide Asana with notice and detail of the dispute no later than the invoice due date. Amounts due are payable in the \\ncurrency set forth in the applicable invoice and are non-cancelable and non-refundable unless otherwise provided in \\nthis Agreement. For customers located outside of the United States, Asana may require that payment be made to the \\nbank account of a local Asana Affiliate. Customer is responsible for providing complete and accurate billing \\ninformation to Asana, including the purchase order number at the time of purchase if Customer requires one. Asana \\nreserves the right to suspend Customer’s account in the event that Customer’s account becomes overdue and is not \\nbrought current within ten (10) business days following notice. Unpaid amounts may be subject to interest at the lesser\\nof 1.5% per month or the maximum permitted by law plus collection costs. Suspension will not relieve Customer’s \\nobligation to pay amounts due. For transactions where Customer is permitted to make payment via credit card, \\nCustomer agrees that, if eligible, Asana may update Customer's payment information through the use of account \\nrefresher services provided by third party payment processors.\\n4.2. End User Subscriptions. Unless otherwise specified in an Order Form, Subscription fees are based on annual periods \\n(or pro rata portions of annual periods). Subscriptions to the Service are sold in tiers based on the number of End \\nUsers. Customer may add End Users to their Subscription at any time on written notice to Asana (email notice \\nacceptable), however the number of End Users acquired under a Subscription cannot be decreased during the \\napplicable Subscription Term. Asana reserves the right to calculate the total number of End Users on a periodic basis, \\nand, if such number exceeds Customer’s current plan size, Asana reserves the right to invoice Customer for the tier \\nthat corresponds to the number of End Users on a pro rata basis for the remaining months in Customer’s then-current \\nannual Subscription Term, so that all End User Subscription Terms are coterminous.\\n4.3. Taxes. Any fees charged to Customer are exclusive of taxes. Except for those taxes based on Asana’s net income, \\nCustomer will be responsible for all applicable taxes in connection with this Agreement including, but not limited to, \\nsales, use, excise, value-added, goods and services, consumption, and other similar taxes or duties. If any withholding \\nVersion 11-2021 Confidential 4\\nis required by law, Customer will pay Asana any additional amounts necessary to ensure that the net amount that \\nAsana receives, after any such withholding, equals the amount Asana would have received if no withholding had been \\napplied. Upon request, Customer will provide documentation showing that the withheld amounts have been paid to \\nthe relevant taxing authority. Asana’s failure to charge appropriate tax due to incomplete or incorrect information \\nprovided by Customer will not relieve Customer of its obligations under this Section 4.3 (Taxes). If Customer is \\nexempt from certain taxes, Customer will provide proof of such exemption to Asana without undue delay upon \\nexecution of the applicable Order Form.\\n5. Term and Termination.\\n5.1. Term. This Agreement commences on the Effective Date and will remain in effect until all Subscriptions to the Service \\ngranted in accordance with this Agreement have expired or been terminated, or this Agreement is otherwise terminated \\nin accordance with its terms.\\n5.2. Termination for Cause. Either party may terminate this Agreement and any Order Form under this Agreement: (a) \\nupon thirty (30) days written notice if the other party is in material breach of this Agreement and fails to cure such \\nbreach within the notice period, except that termination will take effect upon receipt of notice in the event of a breach \\nof Section 2.4 (Acceptable Use Terms); or (b) if the other party ceases its business operations or becomes subject to \\ninsolvency proceedings and the proceedings are not dismissed within sixty (60) days.\\n5.3. Effect of Termination. Upon expiration or termination of this Agreement for any reason, all Subscriptions and any \\nother rights granted to Customer under this Agreement will immediately terminate, and Customer will immediately \\ncease all use of the Service. Upon any termination by either party pursuant to Section 5.2 (Termination for Cause), \\nAsana will refund to Customer a prorated amount of prepaid, unused fees applicable to the remaining portion of the \\nSubscription Term measured from the effective date of termination. In no event will any termination relieve Customer \\nof the obligation to pay any fees accrued or payable to Asana for the Service or Professional Services in the period \\nprior to the effective date of termination. Any terms that by their nature extend beyond the Agreement termination \\nremain in effect until fulfilled and apply to successors and assignees.\\n5.4. Treatment of Customer Data Following Expiration or Termination. Customer agrees that following expiration or \\ntermination of this Agreement, Asana may immediately deactivate Customer’s account(s) associated with the \\nAgreement. Asana will make Customer Data available to Customer for export in accordance with the Documentation \\nas long as Asana receives written notice within thirty (30) days after the effective date of expiration or termination \\nfrom Customer regarding its intent to import such Customer Data. After such thirty (30) day period, Asana will have \\nno obligation to retain Customer Data and will thereafter, unless legally prohibited, be entitled to delete all Customer \\nData in its systems or otherwise in its possession or under its control. Subject to any limitations in Customer’s \\nSubscription plan, upon Customer’s request at datadeletions@asana.com, Asana will, within one-hundred and eighty \\n(180) days of receipt of such request, securely destroy all Customer Data from its systems; provided that all back-ups \\nwill be deleted within thirty (30) days after such one-hundred and eighty (180) day period.\\n6. Confidentiality.\\n6.1. Definition of Confidential Information. During the course of performance under this Agreement, each party may \\nmake available to the other party information that is identified as, or should reasonably be understood by the receiving \\nparty to be, proprietary or confidential (the “Confidential Information”). Confidential Information specifically \\nincludes this Agreement, the Service, Order Form(s), Customer Data, business plans, product plans and roadmaps,\\nsourcecodes, strategies, forecasts, projects and analyses, financial information and fee structures, business processes, \\nmethods and models, and technical documentation. Confidential Information does not include information that is: (a) \\npublicly available when received, or subsequently becomes publicly available through no fault of the receiving party; \\n(b) obtained by receiving party from a source other than the disclosing party without obligation of confidentiality; (c) \\ndeveloped independently by the receiving party; or (d) already in the possession of the receiving party without \\nobligation of confidentiality.\\n6.2. Protection of Confidential Information. The receiving party will use the same care and discretion to avoid \\nCommented [EB1]: We need to make explicit what the \\ntermination period without cause is. E.g. 90 days before end \\nof the applicable subscription term. \\nVersion 11-2021 Confidential 5\\ndisclosure, publication, or dissemination of the disclosing party’s Confidential Information as it uses with its own \\nsimilar information that it does not wish to disclose, publish or disseminate, but in no event less than a reasonable \\ndegree of care. The receiving party may disclose Confidential Information to its employees, Affiliates, consultants, \\nsubcontractors, or advisors (“Representatives”) who have a need to know such Confidential Information for the \\npurpose of performing under this Agreement and only to those who are obligated to maintain the confidentiality of \\nsuch Confidential Information upon terms at least as protective as those contained in this Agreement. If the parties \\nentered into a non-disclosure agreement prior to executing this Agreement, the terms of this Section 6 (Confidentiality)\\nwill control in the event of any conflict or inconsistency.\\n6.3. Equitable Relief. In the event of a breach of this Section 6 (Confidentiality), the disclosing party may seek appropriate \\nequitable relief in addition to any other remedy.\\n6.4. Compelled Disclosure. The receiving party may disclose Confidential Information to the extent required by law or \\ncourt order. However, subject to applicable law, the receiving party will give the disclosing party prompt notice to \\nallow the disclosing party a reasonable opportunity to obtain a protective order.\\n6.5. Sensitive Personal Information. Customer agrees that it will not use the Service to send or store personal information \\ndeemed “sensitive” or “special” under applicable law, including but not limited to financial account information, social \\nsecurity numbers, government-issued identification numbers, health information, biometric or genetic information, \\npersonal information collected from children under the age of 16, geo-location information of individuals, or \\ninformation about an individual’s racial or ethnic origin, trade union membership, sex life or sexual orientation, \\npolitical opinions, or religious or philosophical beliefs (collectively, “Sensitive Personal Information”).\\n7. Intellectual Property Rights.\\n7.1. Intellectual Property Rights. Use of the Service will not affect Customer’s ownership or license rights in Customer \\nData. Asana and its authorized third party service providers may use, host, store, backup, transmit, and display \\nCustomer Data to (a) provide the Service and Professional Services under this Agreement and (b) improve the Service \\nas long as neither Customer nor its End Users are publicly identified. Neither this Agreement nor Customer’s use of \\nthe Service grants Customer or its End Users ownership in the Service, including any enhancements, modifications or \\nderivatives of the Service.\\n7.2. Feedback. If Customer submits any feedback to Asana regarding the Service or Professional Services, Asana may use \\nsuch feedback for any purpose without any compensation or obligation to Customer provided such use does not violate \\nSection 6 (Confidentiality).\\n8. Indemnification.\\n8.1. If a third party asserts a claim against Customer that the Service as acquired under the Agreement infringes a patent \\nor copyright, Asana will (a) defend Customer against that claim and (b) pay amounts finally awarded by a court against \\nCustomer or included in a settlement approved by Asana. To obtain such defense and payment by Asana, Customer \\nmust promptly (i) notify Asana in writing of the claim, (ii) supply information requested by Asana, and (iii) allow \\nAsana to control, and reasonably cooperate in, the defense and settlement, including mitigation efforts.\\n8.2. Asana has no responsibility for claims based on non-Asana products and services, items not provided by Asana, or \\nany violation of law or third party rights caused by Customer Data or other Customer materials if these violations are \\nnot caused by the usage of Asana.\\n8.3. If a third party asserts a claim against Asana that Customer Data infringes a patent or copyright or violates a privacy\\nright, Customer will (a) defend Asana against that claim and (b) pay amounts finally awarded by a court against Asana \\nor included in a settlement approved by Customer. To obtain such defense and payment by Customer, Asana must \\npromptly (i) notify Customer in writing of the claim, (ii) supply information requested by Customer, and (iii) allow \\nCustomer to control, and reasonably cooperate in, the defense and settlement, including mitigation efforts.\\n8.4. This Section states each party’s entire obligation and exclusive remedy regarding the third party claims described in \\nCommented [EB2]: What is the reasoning behind this? we \\nmight need to adjust this in order to fully adapt Asana for \\nour processes.\\nFormatted: Strikethrough\\nVersion 11-2021 Confidential 6\\nthe Section.\\n9. Liability.\\n9.1. A party’s entire liability in the aggregate for all claims related to the Agreement (regardless of the basis of the claim) \\nwill not exceed any actual direct damages incurred by the other party up to the total amount paid by Customer under \\nthis Agreement in the twelve (12) months preceding the first event giving rise to liability.\\n9.2. Neither party will be liable for (a) special, incidental, exemplary, or indirect damages, or any economic \\nconsequential damages, or (b) lost profits, business, value, revenue, goodwill, or anticipated savings.\\n9.3. The following are not subject to the limitation in Section 9.1 and the exclusion in Section 9.2: (a) damages due \\nto a party’s breach of Section 6 (Confidentiality), which is subject to a maximum aggregate liability cap of two \\n(2) times the limitation set forth Section 9.1, (b) a party’s indemnification payments set forth in Section 8\\n(Indemnification), and (c) damages that cannot be limited under applicable law.\\n10. Export Control and Economic Sanctions Compliance. Each party represents that it is not named on any U.S. \\ngovernment list of prohibited or restricted parties, nor is it owned or controlled by or acting on behalf of any such \\nparties. Customer agrees that it will not access or use the Service in any manner that would cause any party to violate \\nany U.S. or international embargoes, economic sanctions, or export controls laws or regulations.\\n11. Miscellaneous.\\n11.1. Governing Law; Venue. Both parties agree to (i) the application of the laws of the State of California, United States, \\nwithout regard to conflict of law principles and (ii) the exclusive jurisdiction and venue in the state or Federal courts \\nlocated in San Francisco, California. The United Nations Convention on Contracts for the International Sale of Goods \\ndoes not apply to transactions under the Agreement.\\n11.2. Notices. Asana may give general notices related to the Service that apply to all customers by email, in-app \\nnotifications, or posting them through the Service. Other notices under the Agreement must be in writing and sent to \\nthe business mailing or email address specified in the signature block, unless a party designates in writing a different \\naddress. Notices are deemed given when received. \\n11.3. Publicity. Asana may include Customer’s name and logo in Asana’s online customer list and in print and electronic \\nmarketing materials, subject to prior written consent of the Customer.\\n11.4. Channel Partners. Customer may acquire Subscriptions through Asana channel partners. Such channel partners are \\nindependent from Asana and unilaterally determine their prices and terms. Asana is not responsible for their actions, \\nomissions, statements or offerings.\\n11.5. Consents. Where approval, acceptance, consent, access, cooperation, or similar action by either party is required, such \\naction will not be unreasonably withheld.\\n11.6. Access to Non-Production Versions of the Service. Customer may be provided with access to beta, trial, proof of \\nconcept, or sandbox versions of the Service or features within the Service (collectively, the “Non-Production \\nVersions of the Service”). Customer acknowledges and understands that its use of the Non-Production Versions of \\nthe Service is not required and is at Customer’s own risk, and that Non-Production Versions of the Service are made \\navailable on an “as is” basis without warranties of any kind, may be discontinued or modified at any time, and may be \\nsubject to other terms. Non-Production Versions of the Service are not for production use, not supported, and not \\nsubject to availability or security obligations. Asana will have no liability for any harm or damage arising out of or in \\nconnection with Non-Production Versions of the Service.\\n11.7. Relationship of the Parties. Asana is an independent contractor, not Customer’s agent, joint venturer, partner, or \\nfiduciary. No right or cause of action for any third party is created by the Agreement or any transaction under it.\\n11.8. Force Majeure. Neither party is responsible for failure to fulfill its non-monetary obligations due to causes beyond \\nDeleted: .\\nVersion 11-2021 Confidential 7\\nits control.\\n11.9. Severability; No Waiver. If any provision of the Agreement is invalid or unenforceable, the remaining provisions \\nremain in full force and effect.\\n11.10. Assignment. Neither party may assign the Agreement, in whole or in part, without the prior written consent of the \\nother. However, either party may assign the Agreement to its Affiliate or to its successor in interest in connection with \\na merger, acquisition, corporate reorganization, or sale of all or substantially all of its assets.\\n11.11. Modifications. Except as set forth in Section 2.5 (Security; Protection of Customer Data), all changes to the \\nAgreement must be in writing accepted by both parties.\\n11.12. Counterparts. This Agreement may be signed in counterparts and/or by electronic signatures. The parties consent to \\nthe use of electronic means as a signed writing. Any reproduction of the Agreement made by reliable means is \\nconsidered an original.\\nAgreed to: Agreed to:\\nAsana, Inc. (“Asana”) BRYTER GmbH (“Customer”)\\n____________________________ ____________________________\\nName: Name:\\nTitle: Title:\\nDate: Date:\\nAddress: 633 Folsom Street, Suite 100 Address: Linienstraße 71, 10119 Berlin, Germany\\nSan Francisco, CA 94107\\nAttn: Legal Department\\nEmail: legal@asana.com Email: heilmann@bryter.io\\nDeleted: [Insert Customer Entity]\\nDeleted: [Insert Customer Address]\\nDeleted: [Insert Customer Email]\\n\\n\",\"word_count\":4411}],\"total_documents\":2,\"total_word_count\":5366}","createdAt":"2025-07-29T10:24:55.031Z","updatedAt":"2025-07-29T10:24:55.031Z"}